# Importation Library

In [1]:
#Importation des librairies
import pandas as pd
import seaborn as sns
import numpy as np
from datetime import date
import matplotlib.mlab as mlab
import matplotlib.pyplot as plt
from matplotlib import pyplot
pd.options.display.max_columns = None
pd.options.display.max_rows = None

# Importation Dataset

In [2]:
customers = pd.read_csv("../data/customers.csv")
products = pd.read_csv("../data/products.csv")
transac = pd.read_csv("../data/transactions.csv")

# Analyse dataset

### Analyse customers

In [3]:
print(customers.shape)
customers.head()

(8623, 3)

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

### Analyse products

In [4]:
print(products.shape)
products.head()

(3287, 3)

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

### Analyse transactions

In [5]:
print(transac.shape)
transac.head()

(337016, 4)

  id_prod                        date session_id client_id
0  0_1483  2021-04-10 18:37:28.723910    s_18746    c_4450
1   2_226  2022-02-03 01:55:53.276402   s_159142     c_277
2   1_374  2021-09-23 15:13:46.938559    s_94290    c_4270
3  0_2186  2021-10-17 03:27:18.783634   s_105936    c_4597
4  0_1351  2021-07-17 20:34:25.800563    s_63642    c_1242

### Analyse des sessions dans la table transactions

In [6]:
transac[transac['session_id'] != 's_0'].sort_values(by=['session_id']).head(10)

       id_prod                        date session_id client_id
176588  0_1259  2021-03-01 00:01:07.843138        s_1     c_329
309544   1_635  2021-03-01 00:10:33.163037       s_10    c_2218
42033   0_1451  2021-03-01 04:43:58.025677      s_100    c_3854
148924  0_1030  2021-03-01 04:12:43.572994      s_100    c_3854
328736  0_1590  2021-03-03 02:49:03.169115     s_1000    c_1014
250061  0_1625  2021-03-03 02:38:09.568389     s_1000    c_1014
214607  0_1438  2021-03-03 03:25:12.320225     s_1000    c_1014
202629  0_1449  2021-03-03 03:18:58.492283     s_1000    c_1014
75293    1_395  2021-03-22 17:46:05.819130    s_10000     c_476
6546    0_1418  2021-03-22 18:15:03.831240    s_10000     c_476

In [7]:
# Sur une session nous pouvons avoir plusieurs achats de differents produits
transac[transac['session_id'] == 's_1000'].head()

       id_prod                        date session_id client_id
202629  0_1449  2021-03-03 03:18:58.492283     s_1000    c_1014
214607  0_1438  2021-03-03 03:25:12.320225     s_1000    c_1014
250061  0_1625  2021-03-03 02:38:09.568389     s_1000    c_1014
328736  0_1590  2021-03-03 02:49:03.169115     s_1000    c_1014

### Left Join

In [8]:
#Merge des tables Transaction et customer en faisant une jointure externe à gauche : clés client_id
trans_and_cust = pd.merge(transac,
                          customers, 
                          on = ["client_id"],
                          how = "left")
print(trans_and_cust.shape)
trans_and_cust.head()

(337016, 6)

  id_prod                        date session_id client_id sex  birth
0  0_1483  2021-04-10 18:37:28.723910    s_18746    c_4450   f   1977
1   2_226  2022-02-03 01:55:53.276402   s_159142     c_277   f   2000
2   1_374  2021-09-23 15:13:46.938559    s_94290    c_4270   f   1979
3  0_2186  2021-10-17 03:27:18.783634   s_105936    c_4597   m   1963
4  0_1351  2021-07-17 20:34:25.800563    s_63642    c_1242   f   1980

In [9]:
#Merge TransactionCustomers avec products en faisant une jointure externe à gauche : clés : id_prod
data = pd.merge(trans_and_cust,
                products,
                on=["id_prod"],
                how="left")

print(data.shape)
data.head()

(337016, 8)

,id_prod,date,session_id,client_id,sex,birth,price,categ
0,0_1483,2021-04-10 18:37:28.723910,s_18746,c_4450,f,1977,4.99,0.0
1,2_226,2022-02-03 01:55:53.276402,s_159142,c_277,f,2000,65.75,2.0
2,1_374,2021-09-23 15:13:46.938559,s_94290,c_4270,f,1979,10.71,1.0
3,0_2186,2021-10-17 03:27:18.783634,s_105936,c_4597,m,1963,4.20,0.0
4,0_1351,2021-07-17 20:34:25.800563,s_63642,c_1242,f,1980,8.99,0.0

In [10]:
#Renommer colones 
data.columns = ["id_produit", "date", "id_session", "id_client", "genre", "a_naissance","prix", "categorie"]
data.head()

,id_produit,date,id_session,id_client,genre,a_naissance,prix,categorie
0,0_1483,2021-04-10 18:37:28.723910,s_18746,c_4450,f,1977,4.99,0.0
1,2_226,2022-02-03 01:55:53.276402,s_159142,c_277,f,2000,65.75,2.0
2,1_374,2021-09-23 15:13:46.938559,s_94290,c_4270,f,1979,10.71,1.0
3,0_2186,2021-10-17 03:27:18.783634,s_105936,c_4597,m,1963,4.20,0.0
4,0_1351,2021-07-17 20:34:25.800563,s_63642,c_1242,f,1980,8.99,0.0

# Verification, analyse, nettoyage

### Verification

In [11]:
# Analyse des types de variables
data.dtypes

id_produit      object
date            object
id_session      object
id_client       object
genre           object
a_naissance      int64
prix           float64
categorie      float64
dtype: object

In [12]:
# Analyse des valeurs nulles
display(data.isnull().sum())

id_produit       0
date             0
id_session       0
id_client        0
genre            0
a_naissance      0
prix           103
categorie      103
dtype: int64

In [13]:
data.describe()

         a_naissance           prix      categorie
count  337016.000000  336913.000000  336913.000000
mean     1977.837150      17.204376       0.429900
std        13.531686      17.855658       0.590999
min      1929.000000      -1.000000       0.000000
25%      1971.000000       8.580000       0.000000
50%      1980.000000      13.900000       0.000000
75%      1987.000000      18.990000       1.000000
max      2004.000000     300.000000       2.000000

### Analyse na's

In [14]:
# Anaylse des na's sur la variable prix
# On creer une sub_dataframe avec uniquement les lignes avec des na's
price_NaN = data['prix'].isnull()
price_NaN_df = data[price_NaN]
print(price_NaN_df.shape)
price_NaN_df.head()

(103, 8)

,id_produit,date,id_session,id_client,genre,a_naissance,prix,categorie
6235,0_2245,2021-06-17 03:03:12.668129,s_49705,c_1533,m,1972,NaN,NaN
10802,0_2245,2021-06-16 05:53:01.627491,s_49323,c_7954,m,1973,NaN,NaN
14051,0_2245,2021-11-24 17:35:59.911427,s_124474,c_5120,f,1975,NaN,NaN
17486,0_2245,2022-02-28 18:08:49.875709,s_172304,c_4964,f,1982,NaN,NaN
21078,0_2245,2021-03-01 00:09:29.301897,s_3,c_580,m,1988,NaN,NaN

In [15]:
# Analyse de id_produit lorsque le prix est na's
price_NaN_df['id_produit'].value_counts()

0_2245    103
Name: id_produit, dtype: int64

In [16]:
# Anaylse des na's sur la variable categorie
# On creer une sub_dataframe avec uniquement les lignes avec des na's
categ_NaN = data['categorie'].isnull()
categ_NaN_df = data[categ_NaN]
print(categ_NaN_df.shape)
categ_NaN_df.head()

(103, 8)

,id_produit,date,id_session,id_client,genre,a_naissance,prix,categorie
6235,0_2245,2021-06-17 03:03:12.668129,s_49705,c_1533,m,1972,NaN,NaN
10802,0_2245,2021-06-16 05:53:01.627491,s_49323,c_7954,m,1973,NaN,NaN
14051,0_2245,2021-11-24 17:35:59.911427,s_124474,c_5120,f,1975,NaN,NaN
17486,0_2245,2022-02-28 18:08:49.875709,s_172304,c_4964,f,1982,NaN,NaN
21078,0_2245,2021-03-01 00:09:29.301897,s_3,c_580,m,1988,NaN,NaN

In [17]:
# Analyse de id_produit lorsque le prix est na's
categ_NaN_df['id_produit'].value_counts()

0_2245    103
Name: id_produit, dtype: int64

In [18]:
# Pourcentage de transactions avec le produit: 0_2245
nb_transaction_ac_0_2245 = len(data[data['id_produit']=='0_2245'])
nb_tot_transaction = len(data)

print('Nombre transaction avec produit 0_2245 = ' + str(nb_transaction_ac_0_2245))
print('Nombre totale de transaction = ' + str(nb_tot_transaction))
print('Pourcentage de transaction avec produit 0_2245 = ' + str(round((nb_transaction_ac_0_2245 / nb_tot_transaction)*100, 4)) + '%')

Nombre transaction avec produit 0_2245 = 103
Nombre totale de transaction = 337016
Pourcentage de transaction avec produit 0_2245 = 0.0306%

In [19]:
#Conclusion des na's: Les na's ne concernent qu'un seul produit: 0_2245
#Concerne 0.0306% des transactions
#Nous pouvons donc supprimer les transactions qui sont na's

### Nettoyage

In [20]:
# On supprime les na's
print(data.shape)
data = data.dropna()
print(data.shape)

(337016, 8)
(336913, 8)

### Analyse prix negatifs

In [21]:
price_negatif_analyse = data[data['prix'] < 0]
price_negatif_analyse.head()

,id_produit,date,id_session,id_client,genre,a_naissance,prix,categorie
1431,T_0,test_2021-03-01 02:30:02.237420,s_0,ct_1,m,2001,-1.0,0.0
2365,T_0,test_2021-03-01 02:30:02.237446,s_0,ct_1,m,2001,-1.0,0.0
2895,T_0,test_2021-03-01 02:30:02.237414,s_0,ct_1,m,2001,-1.0,0.0
5955,T_0,test_2021-03-01 02:30:02.237441,s_0,ct_0,f,2001,-1.0,0.0
7283,T_0,test_2021-03-01 02:30:02.237434,s_0,ct_1,m,2001,-1.0,0.0

In [22]:
price_negatif_analyse.id_produit.value_counts()

T_0    200
Name: id_produit, dtype: int64

In [23]:
#Conclusion: Il y a des lignes correspondants à des transactions test.
#Leurs prix sont negatifs. Il faut donc les supprimer ==> L'id produit à supprimer est T_0
#La conversion en date ne fonctionnera pas car les transactions test on une valeur dans date non reconnu

### Nettoyage

In [24]:
# On supprime les lignes avec des prix negatifs
data = data[data['prix'] > 0]

In [25]:
# Sauvegarde de la data nettoyée
data.to_csv("../data/data_analyse_clean.csv", index = False)